<template>
  <div class="grid">
    <div class="col" style="min-width: 350px">
      <p class="pr-4">
        Храналагічны дыяпазон прадстаўле&#xAD;ных у бібліяграфіі публікацый — 1959–2021 гг. На дадзеным этапе ўлічваліся
        толькі тыя працы, якія апублікаваны на тэрыторыі Беларусі, утрымліваюць лакалізаваны матэрыял (г. зн. абавязкова
        ўказаны прынамсі раён(-ы)) і змяшчаюць тры і больш назваў дробных геаграфічных аб’ектаў.
      </p>
      <D3Map />
    </div>
    <div class="col">
      <p>
        Публікацыі, прысвечаныя разгляду тапонімаў з архіўных крыніц і помнікаў пісьменства, у базу не ўключаліся.
        Акрамя таго, не ўлічваліся працы па гісторыі і крыніцы фальклорна-этнаграфічнага характару, якія часам таксама
        ўтрымліваюць мікратапонімы.
      </p>
      <p>
        Многія публікацыі ў бібліяграфіі забяспечаны каментарыем, які датычыць асаблівасцей падачы назваў дробных
        геаграфічных аб’ектаў у канкрэтнай працы. Адсутнасць такога каментарыя азначае, што мікратапонімы ў публікацыі
        пададзены з пазначэннем націску, указаннем аб’екта і падрабязнай лакалізацыяй. Працы, электронныя версіі якіх
        удалося знайсці ў адкрытых інтэрнэт-крыніцах і прыватных архівах, забяспечаны ў бібліяграфіі спасылкамі.
        Вобласці і раёны вылучаны ў адпаведнасці з адміністрацыйна-тэрытарыяльным падзелам, адлюстраваным у нарматыўных
        даведніках з серыі «Назвы населеных пунктаў Рэспублікі Беларусь» (Мінск, 2003–2010).
      </p>
      <p>
        Звесткі пра не ўлічаныя ў бібліяграфіі або новыя публікацыі адпраўляйце, калі ласка, на адрас
        <strong>vadzim.shkliaryk@gmail.com</strong>. Будзем удзячныя таксама за падрыхтаваныя ў прыватным парадку сканы
        прац, што яшчэ не маюць электронных версій. Усё гэта дазволіць зрабіць бібліяграфію больш інфарматыўнай і
        зручнай.
      </p>
    </div>
    <Card class="shadow-1 mb-2">
      <template #content>
        Шклярык В. А. Мікратапанімія Беларусі: спроба ацэнкі назапашанага фонду // Беларуская лінгвістыка. – 2022. –
        Вып. 88. – С. 79–86.&nbsp;
        <a href="https://drive.google.com/file/d/1LmF3lgwdT-Fybg4pI8fx5DY6xc6uZeMn" style="color: blue" target="_blank">
          <i class="pi pi-external-link" title="Спасылка на файл публікацыі"></i>
        </a>
      </template>
    </Card>
    <Card class="shadow-1">
      <template #content>
        Шклярык В. А. Мікратапанімія Беларусі як аб’ект дысертацыйных даследаванняў // Студії з ономастики та
        етимології. 2021–2022 / НАН України, Інститут української мови; відп. ред. В. П. Шульгач. – Київ, 2022. – С.
        199–203.&nbsp;
        <a href="https://drive.google.com/file/d/12k76cSXxBTkptTDRl8jebHGaPMYOpTBd" style="color: blue" target="_blank">
          <i class="pi pi-external-link" title="Спасылка на файл публікацыі"></i>
        </a>
      </template>
    </Card>
  </div>
</template>
<script setup lang="ts">
import D3Map from './D3Map.vue';
</script>
